RTP/src/Documents/ОформлениеЗаказа/ОформлениеЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОформлениеЗаказа</name>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектТестирования</name>
    <comment>Надо указать ссылку на веб-сайт, который необходимо проверить</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидТестирования</name>
    <comment>Выбрать виды тестирования, которые необходмо провести</comment>
    <type>
      <types>EnumRef.ВидыТестирования</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Бюджет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокиРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДругойСпособСвязи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйБизнесПроцесс</name>
    <type>
      <types>BusinessProcessRef.ПредоставлениеУслугУдаленногоТестирования</types>
    </type>
  </attributes>
</mdclass:Document>

RTP/src/Catalogs/Заказчики/Заказчики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заказчики</name>
  <attributes>
    <name>ФамилияИмяОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказы</name>
    <type>
      <types>CatalogRef.Заказы</types>
    </type>
  </attributes>
</mdclass:Catalog>

RTP/src/Catalogs/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заказы</name>
  <attributes>
    <name>БизнесПроцесс</name>
    <type>
      <types>BusinessProcessRef.ПредоставлениеУслугУдаленногоТестирования</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяГруппа</name>
    <type>
      <types>CatalogRef.РабочиеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Название</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </attributes>
</mdclass:Catalog>

RTP/src/Catalogs/РабочиеГруппы/РабочиеГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеГруппы</name>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Менеджеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Тестировщик</name>
    <type>
      <types>CatalogRef.Тестировщики</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленныйТестировщик</name>
    <type>
      <types>CatalogRef.УдаленныеТестировщики</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСмене</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоАктивныхЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказыВРаботе</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RTP/src/Documents/ОформлениеЗаказа/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	НовыйБизнесПроцесс = СоздатьБизнесПроцесс();
	Если НовыйБизнесПроцесс = Неопределено Тогда
		Отказ = Истина;
	Иначе
		НовыйБизнесПроцесс.Старт();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыПоУмолчанию();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыПоУмолчанию()
	ЭтаФорма.Объект.Заказчик = ПолучитьЗаказчика();
	ЭтаФорма.Объект.Дата = ТекущаяДатаСеанса();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаказчика()
	ТекущийПользователь =  ПараметрыСеанса.ТекущийПользователь;
	Заказчик = Справочники.Заказчики.НайтиПоРеквизиту("Пользователь", ТекущийПользователь.УникальныйИдентификатор);	
	Возврат Заказчик;
КонецФункции

&НаСервере
Функция СоздатьБизнесПроцесс()
	НовыйБизнесПроцесс = Неопределено;
	РегистрацияЗаказа = ЭтотОбъект.Объект;
	РабочаяГруппа = ПолучитьДоступнуюРабочуюГруппу(); 
	Если РабочаяГруппа = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найдена доступная рабочая группа";
		Сообщение.Сообщить();
	Иначе
		НовыйБизнесПроцесс = БизнесПроцессы.ПредоставлениеУслугУдаленногоТестирования.СоздатьБизнесПроцесс();
		НовыйБизнесПроцесс.Заказчик = ПолучитьЗаказчика();
		НовыйБизнесПроцесс.Менеджер = РабочаяГруппа.Менеджер;
		НовыйБизнесПроцесс.Тестировщик = РабочаяГруппа.Тестировщик;
		НовыйБизнесПроцесс.УдаленныйТестировщик = РабочаяГруппа.УдаленныйТестировщик;
		НовыйБизнесПроцесс.ВидТестирования = РегистрацияЗаказа.ВидТестирования;
		НовыйБизнесПроцесс.ОписаниеЗадачи = РегистрацияЗаказа.Комментарии;
		НовыйБизнесПроцесс.Дата = ТекущаяДатаСеанса();	
		НовыйБизнесПроцесс.Записать();
		ОбъектРабочаяГруппа = РабочаяГруппа.ПолучитьОбъект();
		ОбъектРабочаяГруппа.КоличествоАктивныхЗаказов = ОбъектРабочаяГруппа.КоличествоАктивныхЗаказов + 1;
		СоздатьЗаказ(НовыйБизнесПроцесс.Ссылка, РабочаяГруппа);
		ОбъектРабочаяГРуппа.Записать();
	КонецЕсли;
	
	Возврат НовыйБизнесПроцесс;
КонецФункции

&НаСервере
Функция СоздатьЗаказ(БизнесПроцесс, РабочаяГруппа)
	НовыйЗаказ = Справочники.Заказы.СоздатьЭлемент();
	НовыйЗаказ.Название = "Заказ №" + МестноеВремя(ТекущаяДатаСеанса());
	НовыйЗаказ.БизнесПроцесс = БизнесПроцесс;
	НовыйЗаказ.РабочаяГруппа = РабочаяГруппа;
	НовыйЗаказ.Выполнен = Ложь;
	НовыйЗаказ.Заказчик = Справочники.Заказчики.НайтиПоРеквизиту("Пользователь", ПараметрыСеанса.ТекущийПользователь.УникальныйИдентификатор);
	НовыйЗаказ.Записать();
	Возврат НовыйЗаказ.Ссылка;
КонецФункции

&НаСервере
Функция ПолучитьДоступнуюРабочуюГруппу()
	ДоступнаяРабочаяГруппа = Неопределено;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "Выбрать 
	|РГ.Наименование, 
	|РГ.Ссылка,
	|РГ.УникальныйИдентификатор,
	|РГ.КоличествоАктивныхЗаказов
	|ИЗ Справочник.РабочиеГруппы 
	|КАК РГ 
	|ГДЕ РГ.НаСмене = ИСТИНА";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Возврат ПолучитьМенееЗагруженнуюРабочуюГруппу(Выборка);
	КонецЕсли;
	
	Возврат ДоступнаяРабочаяГруппа;
КонецФункции

&НаСервере
Функция ПолучитьМенееЗагруженнуюРабочуюГруппу(Выборка)
	ГруппаСНаименьшимКоличествомЗаказов = Неопределено;
	
	НаименьшееЗначение = 0;
	Счетчик = 0;	
	Пока Выборка.Следующий() Цикл
		Если Счетчик = 0 Тогда
			НаименьшееЗначение = Выборка.КоличествоАктивныхЗаказов;
			ГруппаСНаименьшимКоличествомЗаказов = Выборка.Ссылка;
		ИначеЕсли Выборка.КоличествоАктивныхЗаказов <= НаименьшееЗначение Тогда
			НаименьшееЗначение = Выборка.КоличествоАктивныхЗаказов;
			ГруппаСНаименьшимКоличествомЗаказов = Выборка.Ссылка;			
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
	КонецЦикла;	
	
	Возврат ГруппаСНаименьшимКоличествомЗаказов;
КонецФункции
